import { Link } from "react-router-dom";
import RightSidebar from "../Home/RightSidebar";

const Tenders = () => {
  return (
    <div className=" row mx-auto container my-3">
      <div className="mainBody col-md-9 ">
        <h4 className="text-center">ইজারা</h4>{" "}
        <table className="table">
          <thead>
            <tr>
              <th>প্রকাশের তারিখ </th> <th>বিষয় </th> <th>দেখুন </th>
            </tr>
          </thead>{" "}
          <tbody>
            <tr>
              <td className="text-nowrap">2024-06-24 12:30 pm</td>{" "}
              <td>
                এতদ্বারা সর্বসাধারনের সদয় অবগতির জন্য জানানো যাচ্ছে যে, নিম্নের
                তফসিলে বর্ণিত তারিখ ও সময় মোতাবেক ইউনিয়ন আদর্শ কর তফসিল- ২০১৩ এর
                ১৭ নং ক্রমিকে বর্ণিত বিধান অনুসারে অত্র ৭নং দেবনগড় ইউনিয়ন
                পরিষদের মালিকানাধীন “বিবিধ পণ্য পরিবহনের উপর পারমিট ফিস/পাথর
                ইজারা ” আগামী ২০২৪-২০২৫ অর্থবছরের জন্য ই-ইজারার মাধ্যমে ০১ জুলাই
                ২০২৪ খ্রি. হতে ৩০ জুন ২০২৫ খ্রি. পর্যন্ত ০১ (এক) বৎসর মেয়াদে
                ইজারা বন্দোবস্ত দেওয়া হবে। ইচ্ছুক ইজারা গ্রহিতাকে নির্ধারিত সময়ে
                ই-ইজারা পদ্ধতিতে দরপত্র দাখিলের জন্য আহবান করা যাচ্ছে। দরপত্র
                সিডিউলে উল্লেখিত শর্তাবলী পালন সাপেক্ষে দরপত্রসমূহ নিম্নলিখিত
                তারিখ ও সময়ে ই-ইজারার মাধ্যমে (অন-লাইন) আগামী ৩০/০৬/২০২৪ খ্রি.
                বিকাল ০৫.০০ঘটিকা পর্যন্ত গ্রহন করা হবে। আগামী ০১/০৭/২০২৪ খ্রি.
                বিকাল ৪.০০ঘটিকা সময় উপস্থিত দরপত্র দাতা কিংবা তাদের প্রতিনিধিদের
                সম্মূখে ( যদি কেহ উপস্থিত থাকেন) ই- ইজারা পদ্ধতিতে দরপত্র খোলা
                হবে। দরপত্র সংক্রান্ত যাবতীয় তথ্যাদি, দরপত্র সিডিউল / দলিলাদি
                আগামী ৩০/০৬/২০২৪ পর্যন্ত অফিস চলাকালিন সময় ১,০০০/-( এক হাজার
                টাকা মাত্র) মুল্যে (অফেরত যোগ্য) ০৭নং দেবনগড় ইউনিয়ন পরিষদ অফিসে
                ও সংশ্লিষ্ট উপজেলা নির্বাহী অফিসারের কার্যালয় হতে ক্রয় করা যাবে।
                বিগত বছরের ইজারা মূল্য ও অন্যান্য তথ্যাদি ০৭নং দেবনগড় ইউনিয়ন
                পরিষদ এর ওয়েবসাইট (www.uniontax.gov.bd) থেকে এবং অফিস চলাকালীন
                সময়ে অফিস হতে জানা যাবে।
              </td>{" "}
              <td>
                <a
                  href="/tenderview/9"
                  className="border-1 btn-sm btn_main fs-6 px-3 py-1 text-decoration-none"
                >
                  দেখুন
                </a>
              </td>
            </tr>
            <tr>
              <td>2024-05-16 10:00 am</td>{" "}
              <td>
                এতদ্বারা সর্বসাধারনকে জানানো যাচ্ছে যে, নিম্নের তফসিলে বর্ণিত
                তারিখ ও সময় মোতাবেক ইউনিয়ন পরিষদ আদর্শ কর তফসিল-২০১৩ এর ১৭ নং
                ক্রমিকে বর্ণিত বিধান অনুসারে অত্র ১নং বাংলাবান্ধা ইউনিয়নের
                “বিবিধ পণ্য পরিবহনের উপর পারমিট ফিস” আদায় খাত আগামী ২০২৪-২০২৫
                অর্থ বৎসরের জন্য ই- ইজারার মাধ্যমে ০১ জুলাই ২০২৪ হতে ৩০ জুন ২০২৫
                খ্রি. পর্যন্ত ০১ (এক) বছর মেয়াদে ইজারা বন্দোবস্ত দেওয়া হবে।
                ইচ্ছুক ইজারা গ্রহিতাকে নির্ধারিত সময়ে ই-ইজারা পদ্ধতিতে দরপত্র
                দাখিলের জন্য আহবান জানানো হলো। সর্বসাধারনের অবগতির জন্য শর্ত
                সাপেক্ষে অত্র বিজ্ঞপ্তি জারী করা হলো।
              </td>{" "}
              <td>
                <a
                  href="#"
                  className="border-1 btn-sm btn_main fs-6 px-3 py-1 text-decoration-none"
                >
                  দেখুন
                </a>
              </td>
            </tr>
            <tr>
              <td>2024-05-16 10:00 am</td>{" "}
              <td>
                এতদ্বারা সর্বসাধারনকে জানানো যাচ্ছে যে, নিম্নের তফসিলে বর্ণিত
                তারিখ ও সময় মোতাবেক ইউনিয়ন পরিষদ আদর্শ কর তফসিল-২০১৩ এর ১২ নং
                ক্রমিকে বর্ণিত বিধান অনুসারে অত্র ১নং বাংলাবান্ধা ইউনিয়নের “পশু
                জবাই ফিস” আদায় খাত আগামী ২০২৪-২০২৫ অর্থ বৎসরের জন্য ই- ইজারার
                মাধ্যমে ০১ জুলাই ২০২৪ হতে ৩০ জুন ২০২৫ খ্রি. পর্যন্ত ০১ (এক) বছর
                মেয়াদে ইজারা বন্দোবস্ত দেওয়া হবে। ইচ্ছুক ইজারা গ্রহিতাকে
                নির্ধারিত সময়ে ই-ইজারা পদ্ধতিতে দরপত্র দাখিলের জন্য আহবান জানানো
                হলো। সর্বসাধারনের অবগতির জন্য শর্ত সাপেক্ষে অত্র বিজ্ঞপ্তি জারী
                করা হলো।
              </td>{" "}
              <td>
                <Link
                  to={"/"}
                  className="border-1 btn-sm btn_main fs-6 px-3 py-1 text-decoration-none"
                >
                  দেখুন
                </Link>
              </td>
            </tr>
            <tr>
              <td>1970-01-01 6:00 am</td> <td />{" "}
              <td>
                <a
                  href="#"
                  className="border-1 btn-sm btn_main fs-6 px-3 py-1 text-decoration-none"
                >
                  দেখুন
                </a>
              </td>
            </tr>
            <tr>
              <td>2023-05-25 4:20 pm</td>{" "}
              <td>
                এতদ্বারা সর্বসাধারনের সদয় অবগতির জন্য জানানো যাচ্ছে যে, ইউনিয়ন
                পরিষদের মালিকানাধীন রপ্তানি কর ২০২৩-২০৩৪ সনের জন্য অর্থ্যা
                ০১/০৭/২০২৩ খ্রি. হতে এক বৎসর মেয়াদে ইজারার নিমিত্তে সিলগালা খামে
                দরপত্র আহবান করা যাচ্ছে। দরপত্র সিডিউলে উল্লেখিত শর্তাবলী পালন
                সাপেক্ষে দরপত্রসমূহ নিম্নলিখিত তারিখ ও সময়ে কেবল মাত্র ১নং
                বাংলাবান্ধা ইউনিয়ন পরিষদ কার্যালয়ে রক্ষিত দরপত্র বাক্সে
                ১৩/০৬/২০২৩খ্রি. ০৫.০০ঘটিকা পর্যন্ত গ্রহন করা হবে। ঐ দিনই
                ১৩/০৬/২০২৩খ্রি. ০৫.০০ঘটিকা সময় উপস্থিত দরপত্র দাতা কিংবা তাদের
                প্রতিনিধিদের সম্মূখে ( যদি কেহ উপস্থিত থাকেন) খোলা হবে। দরপত্র
                সংক্রান্ত যাবতীয় তথ্যাদি, দরপত্র সিডিউল / দলিলাদি দরপত্র গ্রহনের
                পূর্বদিন পর্যন্ত অফিস চলাকালিন সময় ১০০০০০/-( এক লক্ষ) টাকা
                মুল্যে (ফেরত যোগ্য) ১নং বাংলাবান্ধা ইউনিয়ন পরিষদ অফিসে ও
                সংশ্লিষ্ট উপজেলা নির্বাহী অফিসারের কার্যালয় হতে ক্রয় করা যাবে।
                দরপত্র দাখিলের দিন কোন দরপত্র সিডিউল বিক্রি করা হবে না। বিগত
                বছরের ইজারা মূল্য ও অন্যান্য তথ্যাদি ১নং বাংলাবান্ধা ইউনিয়ন
                পরিষদ এর ওয়েবসাইট (www.uniontax.gov.bd) থেক এবং অফিস চলাকালীন
                সময়ে অফিস হতে জানা যাবে।
              </td>{" "}
              <td>
                <a
                  href="#"
                  className="border-1 btn-sm btn_main fs-6 px-3 py-1 text-decoration-none"
                >
                  দেখুন
                </a>
              </td>
            </tr>
            <tr>
              <td>2023-06-30 5:04 pm</td>{" "}
              <td>
                এতদ্বারা সর্বসাধারনের সদয় অবগতির জন্য জানানো যাচ্ছে যে, ইউনিয়ন
                পরিষদের মালিকানাধীন রপ্তানি কর 2023-2024 সনের জন্য অর্থ্যা
                ০১/০৭/২০২৩ খ্রি. হতে এক বৎসর মেয়াদে ইজারার নিমিত্তে সিলগালা খামে
                দরপত্র আহবান করা যাচ্ছে। দরপত্র সিডিউলে উল্লেখিত শর্তাবলী পালন
                সাপেক্ষে দরপত্রসমূহ নিম্নলিখিত তারিখ ও সময়ে কেবল মাত্র ০৭নং
                দেবনগড় ইউনিয়ন পরিষদ কার্যালয়ে রক্ষিত দরপত্র বাক্সে
                ১১/০৭/২০২৩খ্রি. ০৫.০০ঘটিকা পর্যন্ত গ্রহন করা হবে। ঐদিনই
                ১১/০৭/২০২৩খ্রি. ০৫.০০ঘটিকা সময় উপস্থিত দরপত্র দাতা কিংবা তাদের
                প্রতিনিধিদের সম্মূখে ( যদি কেহ উপস্থিত থাকেন) খোলা হবে। দরপত্র
                সংক্রান্ত যাবতীয় তথ্যাদি, দরপত্র সিডিউল / দলিলাদি দরপত্র গ্রহনের
                পূর্বদিন পর্যন্ত অফিস চলাকালিন সময় ৪৯৯/-( চারশত নিরানব্বই টাকা
                মাত্র) মুল্যে (অফেরত যোগ্য) ০৭নং দেবনগড় ইউনিয়ন পরিষদ অফিসে ও
                সংশ্লিষ্ট উপজেলা নির্বাহী অফিসারের কার্যালয় হতে ক্রয় করা যাবে।
                দরপত্র দাখিলের দিন কোন দরপত্র সিডিউল বিক্রি করা হবে না। বিগত
                বছরের ইজারা মূল্য ও অন্যান্য তথ্যাদি ০৭নং দেবনগড় ইউনিয়ন পরিষদ এর
                ওয়েবসাইট (www.uniontax.gov.bd) থেক এবং অফিস চলাকালীন সময়ে অফিস
                হতে জানা যাবে।
              </td>{" "}
              <td>
                <a
                  href="#"
                  className="border-1 btn-sm btn_main fs-6 px-3 py-1 text-decoration-none"
                >
                  দেখুন
                </a>
              </td>
            </tr>
            <tr>
              <td>2023-07-01 5:00 pm</td>{" "}
              <td>
                এতদ্বারা সর্বসাধারনের জন্য জানানো যাচ্ছে যে, ইউনিয়ন পরিষদের
                মালিকানাধীন টেস্ট ২০২২-২৩ সনের জন্য অর্থাৎ ০১/০৭/২০২২খ্রি. হতে
                এক বৎসর মেয়াদে ইজারার নিমিত্ত সিলগালা খামের আহবান করা যাচ্ছে।
                দরপত্র সিডিউলে উল্লেখিত শর্তাবলী পালন সাপেক্ষে দরপত্র সমূহ
                নিম্নলিখিত তারিখ ও সময়ে কেবল মাত্র ইউনিয়ন ট্যাক্স টেস্ট
                কার্যালয়ে রক্ষিত দরপত্র বাক্স ০৯/০৭/২০২৩ ০৭.২৩ ঘটিকা পর্যন্ত
                গ্রহণ করা হবে। ঐদিনই ১৩/০৭/২০২৩ ০৭.২৩ ঘটিকার সময় উপস্থিত দরপত্র
                দাতা কিংবা তাদের প্রতিনিধিদের সম্মুখে (যদি কেহ উপস্থিত থাকেন)
                খোলা হবে। দরপত্র সংক্রান্ত যাবতীয় তথ্যাদি, দরপত্র সিডিউল/দলিলাদি
                দরপত্র গ্রহণের পূর্বদিন পর্যন্ত অফিস চলাকালীন সময় ৫০০/- (একশত
                টাকা মাত্র) মূল্য (অফেরত যোগ্য) ইউনিয়ন ট্যাক্স টেস্ট অফিসে ও
                সংশ্লিষ্ট উপজেলা নির্বাহী অফিসারের কার্যালয় হইতে ক্রয় করা যাবে।
                দরপত্র দাখিলের দিন কোন দরপত্র সিডিউল বিক্রি করা হবে না। বিগত
                বছরের ইজারা মূল্য ও অন্যান্য তথাদি ইউনিয়ন ট্যাক্স টেস্ট এর
                ওয়েবসাইট (www.uniontax.gov.bd )থেকে এবং অফিস চলাকালীন সময়ে অফিস
                হতে জানা যাবে।
              </td>{" "}
              <td>
                <a
                  href="#"
                  className="border-1 btn-sm btn_main fs-6 px-3 py-1 text-decoration-none"
                >
                  দেখুন
                </a>
              </td>
            </tr>
            <tr>
              <td>2023-07-05 7:23 pm</td> <td>testtesttesttesttesttest</td>{" "}
              <td>
                <a
                  href="#"
                  className="border-1 btn-sm btn_main fs-6 px-3 py-1 text-decoration-none"
                >
                  দেখুন
                </a>
              </td>
            </tr>
          </tbody>
        </table>
      </div>
      <RightSidebar />
    </div>
  );
};

export default Tenders;
